import logo from "../../resources/images/k9ewtae8b8f0.jpeg";

import ThumbDownAltIcon from "@mui/icons-material/ThumbDownAlt";
import ThumbUpIcon from "@mui/icons-material/ThumbUp";
import { useState } from "react";

const Title1 = () => {
  const [height, setHeight] = useState(false);
  const [cuonter, setCuonter] = useState(23);

  const removeCuonte = () => {
    setCuonter(cuonter - 1);
  };
  const addCuonter = () => {
    setCuonter(cuonter + 1);
  };

  const toggleHeight = (value) => {
    setHeight(value);
  };

  return (
    <div className="title">
      <div
        className="container-text"
        style={{ height: height ? "1000px" : "450px", direction: "rtl" }}
      >
        <h1> گولنگ: چرا گولنگ ؟</h1>

        <p>
          گولنگ زبان نسبتا جوان اما محبوب بین برنامه نویسان است. بنابر نظرسنجی
          سایت StackOverflow، گولنگ سومین زبانی است که توسعه دهندگان علاقه به
          مطالعه دارند. در این مقاله، سعی خواهیم کرد دلایل محبوبیت گو را بیان
          کنیم و همچنین ببینیم در چه جاهایی از این زبان استفاده می شود و چرا
          ارزش یادگرفتن دارد. اگر شما تازه وارد دنیای برنامه نویسی شده‌اید می
          توانید گولنگ را به عنوان اولین زبان برنامه‌نویسی‌یتان یاد بگیرید.
        </p>

        <img src={logo} className="App-logo" alt="logo" />
        <h2>خلاصه ای از تاریخچه گو</h2>
        <p>
          گولنگ در شرکت گوگل مفهوم‌سازی و طراحی شد و اسمش را هم از دو حرف اول
          نام این شرکت (گوگول) گرفته است. این زبان توسط Robert Griesemer، Rob
          Pike (یکی از خالقان UTF8)، وKen Thompson افسانه‌ای، خالق Unix و زبان B
          (جد C)، طراحی و بنا گذاشته شد. گولنگ شباهت‌هایی به زبان C، و مانند C،
          دارد و یک ابزار برای برنامه‌نویسان حرفه‌ای است. با گو، بیشترین اثر و
          نتیجه را با کمترین تلاش بدست می آورید. بنابراین، این زبان بسیار فراتر
          از یک نسخه بروزشده زبان C است. گو در اصل جایگزینی برای ++C بود چرا که
          ++C زبانی بسیار عریض‌وطویل و دشوار است بخصوص فهمیدن آخرین استانداردهای
          آن. در مقایسه با ++C، گو زبانی راحت‌تر و آسان‌تر برای یادگیری است. گو
          از ایده های خوب زبان‌های مختلف برنامه‌نویسی استفاده و اقتباس می کند،
          این در حالی است که از ویژگی‌هایی که منجر به پیچیدگی، نامطمئنی و
          ناپایداری کد می شود تا حدی دوری می‌کند. ابزارهای گو نیز برای مسئله
          همروندی جدید است و به منظور بهره‌وری بیشتر است. گولنگ بخصوص مناسب برای
          توسعه زیرساخت، مانند سرورهای شبکه، و همچنین ابزارها و سیستم‌ها برای
          برنامه‌نویسان است. بااین‌حال این زبان برنامه نویسی یک زبان هم منظوره
          است و در حوزه‌هایی مانند گرافیک، اپلیکیشن‌های موبایل، و یادگیری ماشین
          استفاده می‌شود. گولنگ به شما این توانایی را می دهد تا یک پروژه را
          سریع، راحت و قابل استفاده در شکل میکروسرویس پیاده‌‎سازی کنید. این یک
          مزیت برای شرکت‌هایی است که می خواهند محصولات تخصصی خود را در سرویس‌های
          کوچک تولید کنند. در این مورد دیگر توجیه ندارد از فریم‌ورک‌هایی استفاده
          کنند که در سیستم های یکپارچه قابل استفاده است. برنامه‌هایی که با گولنگ
          نوشته شده‌اند به طور معمول سریع‌تر از برنامه‌‎های نوشته شده با دیگر
          زبان‌های برنامه‌نویسی هستند و به شما کمک می کنند تا نرم‌افزهای پیچیده
          و جالب را توسعه دهید. از آنجایی که گولنگ یک زبان برنامه نویسی متن باز
          است، سورس‌کد آن به طور آزاد و رایگان قابل دسترس است. کامپایلر،
          کتابخانه‌ها، و ابزار آن نیز به طور رایگان برای همه قابل استفاده است.
        </p>
        <a
          href={
            "https://virgool.io/golangpub/%DA%AF%D9%88%D9%84%D9%86%DA%AF-%DA%86%D8%B1%D8%A7-%D8%A8%D8%A7%DB%8C%D8%AF-%DA%AF%D9%88%D9%84%D9%86%DA%AF-%D8%B1%D8%A7-%D8%AF%D8%B1-1400-%DB%8C%D8%A7%D8%AF-%D8%A8%DA%AF%DB%8C%D8%B1%DB%8C%D8%AF-foq7ylithmje"
          }
          style={{ textDecoration: "none", color: "black" }}
        >
          منبع
        </a>
      </div>
      <div className="container-dital">
        <div className="like">
          <button onClick={() => removeCuonte()}>
            <ThumbDownAltIcon />
          </button>
          <h5>{cuonter}</h5>
          <button onClick={() => addCuonter()}>
            <ThumbUpIcon />
          </button>
        </div>

        <button className="close-open" onClick={() => toggleHeight(!height)}>
          {height ? `بستن صفحه` : `ادامه مطلب`}
        </button>
      </div>
    </div>
  );
};

export default Title1;
